In [ ]:
import sqlite3

In [ ]:
import sqlite3

db_name = "users.db"

conn = sqlite3.connect(db_name)

print("Opened database successfully")

Opened database successfully

| Data Type | Description | Example |
|-----------|-------------|---------|
| INT       | Integer value representing a whole number | 10, -5, 0 |
| VARCHAR(50) | Variable-length character string with a maximum length of 50 characters | 'Python', 'is awesome' |
| TEXT |  does not require specifying a maximum length limit. suitable to store large amounts of text.| 'Python is awesome language' |
| FLOAT     | Floating-point number with decimal precision | 3.14, -0.5 |
| DATE      | Date value in the format 'YYYY-MM-DD' | '2023-06-24', '1990-01-01' |
| BOOLEAN   | Boolean value representing true or false | true, false |

In [ ]:
conn.execute(""" CREATE TABLE employee
          (
            ID            INT             PRIMARY KEY    NOT NULL,
            NAME          VARCHAR(1000)                  NOT NULL,
            AGE           INT                            NOT NULL,
            ADDRESS       TEXT,
            SALARY        FLOAT
          )
             """)

In [ ]:
conn.execute("""INSERT INTO
            employee (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00 )
          """)

IntegrityError: ignored

In [ ]:
conn.execute("""INSERT INTO
           company (ID,NAME,AGE,ADDRESS) VALUES (2, 'shyam', 20, 'lalitpur')
         """)

In [ ]:
conn.execute("""INSERT INTO
           company (ID,NAME,AGE, SALARY) VALUES (3, 'shyam', 20, 10000)
         """)
conn.commit()

In [ ]:
conn.execute("""INSERT INTO
           company (ID,NAME,AGE) VALUES (4, 'shyam', 20)
         """)

conn.commit()

In [ ]:
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
  print(row)
  print('---------------')

# for row in cursor:
#    print("ID = ", row[0])
#    print("NAME = ", row[1])
#    print("ADDRESS = ", row[2])
#    print("SALARY = ", row[3], "\n")

(4, 'shyam', None, None)
---------------
(3, 'shyam', None, 10000.0)
---------------

In [ ]:
select_items = conn.execute('SELECT * FROM employee').fetchall()
print(select_items)

[(1, 'Paul', 32, 'California', 20000.0)]

In [ ]:
conn.execute("UPDATE company set SALARY = 25000.00 where ID = 4")

In [ ]:
conn.execute("DELETE From company where name = 'shyam'")

conn.commit()

# close connection to database
conn.close()

In [ ]:
cursor = conn.execute('select * from company').fetchall()
print(cursor)

[(1, 'Paul', 32, 'California', 20000.0)]